---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternallyTaggedGeometryObject
source: html/067a3959-d1df-c65c-c4df-a7ab61b2c9be.htm
---
# ExternallyTaggedGeometryObject Properties

The external Id of the geometry object.